In [2]:
import pandas as pd

In [3]:
dict={'name':['Hari','Narayana','Vasudeva','Madhava'],'yuga':['Sarva','Sarva','Dwapara','Dwapara']}

In [4]:
df=pd.DataFrame(dict)
df

       name     yuga
0      Hari    Sarva
1  Narayana    Sarva
2  Vasudeva  Dwapara
3   Madhava  Dwapara

# index functions

In [6]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [11]:
#gives error bcz immutable
for i in range(len(df.index)):
    df.index[i]= f'deva {i}'

TypeError: Index does not support mutable operations

In [13]:
df.index=[f'deva {i}' for i in range(len(df))]
df

            name     yuga
deva 0      Hari    Sarva
deva 1  Narayana    Sarva
deva 2  Vasudeva  Dwapara
deva 3   Madhava  Dwapara

In [15]:
df.index.name='Devata'
df

            name     yuga
Devata
deva 0      Hari    Sarva
deva 1  Narayana    Sarva
deva 2  Vasudeva  Dwapara
deva 3   Madhava  Dwapara

In [17]:
df=df.set_index('name')
df

             yuga
name
Hari        Sarva
Narayana    Sarva
Vasudeva  Dwapara
Madhava   Dwapara

In [19]:
df=df.reset_index()
df

       name     yuga
0      Hari    Sarva
1  Narayana    Sarva
2  Vasudeva  Dwapara
3   Madhava  Dwapara

In [21]:
df.index.name='index_num'
df

               name     yuga
index_num
0              Hari    Sarva
1          Narayana    Sarva
2          Vasudeva  Dwapara
3           Madhava  Dwapara

In [23]:
df=df.reset_index().set_index('name')
df

          index_num     yuga
name
Hari              0    Sarva
Narayana          1    Sarva
Vasudeva          2  Dwapara
Madhava           3  Dwapara

In [33]:
df.rename(columns={'index_num':'new'},inplace=True)

In [35]:
df

          new     yuga
name
Hari        0    Sarva
Narayana    1    Sarva
Vasudeva    2  Dwapara
Madhava     3  Dwapara